import std;

int main()
{
	std::println("----------------------------------------");
	std::println("ЛР №: 1");
	std::println("Группа: 6113");
	std::println("Автор: Петрова Е.В.");
	std::println("Вариант: 17");
	std::println("----------------------------------------");

	// Проверить, являются ли все элементы последовательности отрицательными.
	int n;
	int count = 0;
	bool all_negative = true;
	int num;

	std::println("-----------------------------------------");
	std::println("Ввод данных:");
	std::println("-----------------------------------------");

	std::println("Веедите количество элементов последовательности: ");
	std::cin >> n;

	while (count < n)
	{
		std::println("Введите элемент: ");
		std::cin >> num;
		count++;
		if (num >= 0)
		{
			all_negative = false;
		}
	}

	std::println("-----------------------------------------");
	std::println("Ответ:");
	std::println("-----------------------------------------");
	if (all_negative)
	{
		std::println("Да, все элементы последовательности являются отрицательными.");
	}
	else
	{
		std::println("Нет (есть хотя бы одно неотрицательное число)\n");
	}
}